Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: (An enum without associated values has Equatable conformance even without the declaration.)
ja: （関連値なしでのenumは、Equatable準拠をたとえ宣言なしでも持ちます。）

source: (An enum without associated values has Hashable conformance even without the declaration.)
ja: （関連値なしでのenumは、Hashable準拠をたとえ宣言なしでも持ちます。）

source: (Enumerations without associated values have Equatable and Hashable conformance even without declaring adoption.)
ja: （関連値なしの列挙は、EquatableおよびHashable準拠を持ちます、たとえ採用を宣言することなしでも。）

source: (In Swift 5.1 and earlier, isCanonical is true for these values, which is the incorrect value.)
ja: （Swift 5.1およびそれより前では、isCanonicalはこれらの値に対してtrueです、それは不正確な値です。）

source: (Irreflexivity)
ja: （非反射）

source: (Reflexivity)
ja: （反射性）

source: (Symmetry)
ja: （対称性）

source: (These may become compile-time errors in the future.)
ja: （それらはコンパイル時エラーに将来はなるかもしれません。）

source: (Transitive comparability)
ja: （推移的比較性）

source: (Transitive incomparability)
ja: （推移的比較不能性）

source: (Transitivity)
ja: （推移性）

source: / A genuinely asychronous implementation uses the `Task`
ja: / 真に非同期の実装は `Task`

source: / API to check for cancellation here and return early.
ja: / API を使用して取り消しをここで調べて、より早くに復帰します。

source: -infinity compares less than all values except for itself and NaN.
ja: -infinityは、それ自身とNaNを除くすべての値より少ないと比較されます。

source: -infinity compares less than or equal to all values except NaN.
ja: -infinityは、NaNを除くすべての値より少ないか等しいと比較されます。

source: AnyHashable considers bridged counterparts (such as a String and an NSString) of the same value to be equivalent when type-erased.
ja: AnyHashableは、同じ値のブリッジされた相当物（たとえばStringとNSString）を同等であると、型消去される場合にはみなします。

source: AnyObject can also be used as the concrete type for an instance of a type that bridges to an Objective-C class.
ja: AnyObjectはまた、Objective-Cクラスへとブリッジするある型のインスタンスに対する具象型として使われることができます。

source: ArraySlice instances are not always indexed from zero.
ja: ArraySliceインスタンスは、常にゼロからインデックスをつけられるわけではありません。

source: AsyncSequence also defines methods for processing the elements you receive, modeled on the operations provided by the basic Sequence in the standard library.
ja: AsyncSequenceはまた、あなたが受け取る要素を処理するために、標準ライブラリの基本のSequenceによって提供される演算を手本にしてメソッドいくつかを定義します。

source: AutoreleasingUnsafeMutablePointer is assumed to reference a value with __autoreleasing ownership semantics, like NSFoo ** declarations in ARC.
ja: AutoreleasingUnsafeMutablePointerは、__autoreleasing所有権意味論をもつ値を参照すると仮定されます、ARCにおけるNSFoo **宣言のような。

source: Bool represents Boolean values in Swift.
ja: Boolはブール値をSwiftにおいて表します。

source: Bool, DarwinBoolean, ObjCBool, and WindowsBool are treated as Boolean values.
ja: Bool、DarwinBoolean、ObjCBool、そしてWindowsBoolは、ブール値として扱われます。

source: CGPoint, CGSize, and CGRect
ja: CGPoint、CGSize、およびCGRect

source: CheckedContinuation logs a message if either of these invariants is violated.
ja: CheckedContinuationは、これら不変式のどれかが侵害されるならばメッセージを記録します。

source: CheckedContinuation performs runtime checks for missing or multiple resume operations.
ja: CheckedContinuationは、見つからないまたは複数の再開操作に対する実行時検査を実行します。

source: Codable is a type alias for the Encodable and Decodable protocols.
ja: Codableは、EncodableとDecodableプロトコルに対する型エイリアスです。

source: Date and NSDate
ja: DateおよびNSDate

source: DefaultStringInterpolation extensions should add only mutating members and should not copy self or capture it in an escaping closure.
ja: DefaultStringInterpolation拡張は、mutatingメンバだけを加えるべきです、そして脱出クロージャにおいてselfをコピーまたはそれをキャプチャすべきではありません。

source: EmptyCollection does not have any element indices, so it is not possible to advance indices.
ja: EmptyCollectionは、全く要素インデックスを持ちません、それでインデックスを進めることは可能ではありません。

source: EnumeratedSequence is a sequence of pairs (n, x), where ns are consecutive Int values starting at zero, and xs are the elements of a base sequence.
ja: EnumeratedSequenceは、ペア (n, x) からなるシーケンスです、ここでnはゼロで始まる連続したIntです、そしてxは基盤シーケンスの要素です：

source: Float and Double
ja: FloatおよびDouble

source: Hashable conformance means that you can store positions in a set and quickly check whether you've visited a position before, as shown in the following example:
ja: Hashable準拠は、あなたが集合の中の位置を格納して前にあなたが訪れた位置かどうかを素早く確認できることを意味します、以下の例で示すように：

source: Hasher can be used to map an arbitrary sequence of bytes to an integer hash value.
ja: Hasherは、随意のバイト列を整数ハッシュ値へとマップするのに使われます。

source: Hasher is usually randomly seeded, which means it will return different values on every new execution of your program.
ja: Hasherは、ふつうは無作為にシードを決められます、それはあなたのプログラムの新規の実行ごとに異なる値が返されることを意味します。

source: Identifiable leaves the duration and scope of the identity unspecified.
ja: Identifiableは、同一性の期間とスコープを特定されないようにします。

source: Identifiable provides a default implementation for class types (using ObjectIdentifier), which is only guaranteed to remain unique for the lifetime of an object.
ja: Identifiableは、省略時の実装をクラス型に対して提供します（ObjectIdentifierを使って）、それはあるオブジェクトの存続期間に対して特有のままであることだけを保証されます。

source: Int, UInt, and the other standard library integer types
ja: Int、UInt、そして他の標準ライブラリの整数型

source: IteratorOverOne is the iterator for the CollectionOfOne type.
ja: IteratorOverOneは、CollectionOfOne型のためのイテレータ。

source: NSBezierPath and UIBezierPath
ja: NSBezierPathおよびUIBezierPath

source: NSColor, UIColor, CGColor, and CIColor
ja: NSColor、UIColor、CGColor、およびCIColor

source: NSImage, UIImage, CGImage, and CIImage
ja: NSImage、UIImage、CGImage、およびCIImage

source: NSObject subclasses inherit conformance to the Equatable and Hashable protocols, with equality based on instance identity.
ja: NSObjectサブクラスは、EquatableとHashableプロトコルへの準拠を継承します、インスタンス同一性に基づく同等性を使います。

source: NSView and UIView
ja: NSViewおよびUIView

source: Pointee must be a class type or Optional<C> where C is a class.
ja: Pointeeは、クラス型またはOptional<C>でなければなりません、そこでCはクラスです。

source: String and NSString
ja: StringおよびNSString

source: T.min.isMultiple(of: -1) is true for signed integer T, even though the quotient T.min / -1 isn’t representable in type T.
ja: T.min.isMultiple(of: -1)はtrueです、符号付き整数Tに対して、たとえ商T.min / -1が型Tで表現可能でなくてさえ。

source: URL and NSURL
ja: URLおよびNSURL

source: a < a is always false (Irreflexivity)
ja: a < aは常にfalse（非反射）

source: a < b and b < c implies a < c (Transitivity)
ja: a < bかつb < cはa < cを意味する（推移）

source: a < b implies !(b < a) (Asymmetry)
ja: a < bは!(b < a)を意味する（非対称）

source: a == a is always true (Reflexivity)
ja: a == aは、常にtrue（反射）

source: a == b and b == c implies a == c (Transitivity)
ja: a == bかつb == cは、a == cを意味する（推移）

source: a == b implies b == a (Symmetry)
ja: a == bは、b == aを意味する（対称）

source: areEquivalent(a, a) is always true.
ja: areEquivalent(a, a)は常にtrueである。

source: areEquivalent(a, b) implies areEquivalent(b, a).
ja: areEquivalent(a, b)はareEquivalent(b, a)を意味する。

source: areInIncreasingOrder(a, a) is always false.
ja: areInIncreasingOrder(a, a)は常にfalseである。

source: areInIncreasingOrder must be a strict weak ordering over the elements.
ja: areInIncreasingOrderは、それら要素に対して厳密弱順序でなければなりません。

source: body is executed each time the next() method is called on the resulting iterator.
ja: bodyは、結果として生じるイテレータでnext()メソッドが呼び出されるたびに実行されます。

source: condition is not evaluated in -Ounchecked builds.
ja: conditionは、-Ouncheckedビルドにおいては評価されません。

source: condition is only evaluated in playgrounds and -Onone builds.
ja: conditionはただプレイグラウンドと-Ononeにおいて評価されるだけです。

source: count must be greater than or equal to zero.
ja: countは、ゼロより大きいか等しくなければなりません。

source: defaultValue and optional have the same type.
ja: defaultValueとoptionalは同じ型を持ちます。

source: defaultValue is the same type as the Wrapped type of optional.
ja: defaultValueは、optionalのWrapped型と同じ型です。

source: end is an element of the resulting sequence if and only if it can be produced from start using steps of stride.
ja: endは、それがstartからstrideの間隔を使って生成可能であるときかつその場合に限り、結果のシーケンスの要素です。

source: end is never an element of the resulting sequence.
ja: endは、決して結果シーケンスの要素ではありません。

source: end must be a valid index of the collection.
ja: endはコレクションのひとつの有効なインデックスでなければなりません。

source: endIndex is always reachable from startIndex by zero or more applications of index(after:).
ja: endIndexは、常にstartIndexからindex(after:)のゼロまたはそれ以上の適用によって到達可能です。

source: endIndex is not a valid argument to subscript, and is always reachable from startIndex by zero or more applications of index(after:).
ja: endIndexはsubscriptに対する有効な引数ではありません、そして常にstartIndexからゼロまたはそれ以上のindex(after:)の適用によって到達可能です。

source: greatestFiniteMagnitude.ulp is a finite number, even though the next greater representable value is infinity.
ja: greatestFiniteMagnitude.ulpは有限数です、たとえ次のより大きい表現可能な値がinfinityであるとしても。

source: hashValue is deprecated as a Hashable requirement.
ja: hashValueは、Hashable要件として非推奨にされます。

source: i must be 0.
ja: iは0でなければなりません。

source: i must be 1.
ja: iは1でなければなりません。

source: i must be greater than startIndex.
ja: iはstartIndexより大きくなければなりません。

source: i must be less than endIndex.
ja: iはendIndexより少なくなければなりません。

source: index must be a valid index of the array or equal to its endIndex property.
ja: indexは、配列の有効なインデックスまたはそれのendIndexプロパティでなければなりません。

source: index must be a valid index of the array.
ja: indexは配列の有効なインデックスでなければなりません。

source: index must be a valid index of the collection.
ja: indexはコレクションの有効なインデックスでなければなりません。

source: index must be a valid index of the dictionary, and must not equal the dictionary’s end index.
ja: indexは辞書の有効なインデックスでなければなりません、そして辞書の末尾インデックスと同じではなりません。

source: index must be greater than or equal to startIndex and less than endIndex.
ja: indexは、startIndexより大きいか等しくそしてendIndexより小さくなくてはなりません。

source: index must be in the range 0..Count.
ja: indexは、範囲0..Countの中になければなりません。

source: initialResult is passed to nextPartialResult the first time the closure is executed.
ja: initialResultはnextPartialResultに、クロージャが実行される最初の時に渡されます。

source: isKnownUniquelyReferenced(_:) checks only for strong references to the given object—if object has additional weak or unowned references, the result may still be true.
ja: isKnownUniquelyReferenced(_:)は与えられたオブジェクトに対する強い参照に対してのみ確認します — objectがさらに弱いまたは非所有参照を持つ場合、結果は依然としてtrueです。

source: k must be greater than or equal to zero and must not exceed the number of elements in the collection.
ja: kは、ゼロより大きいか等しくなければなりません、そしてコレクションの中の要素の数を越えてはいけません。

source: k must be greater than or equal to zero, and must be less than or equal to the number of elements in the collection.
ja: kは、ゼロより大きいか等しくなければなりません、そしてコレクションの要素数より少ないか等しくなければなりません。

source: k must be greater than or equal to zero.
ja: kは、ゼロより大きいか等しくなければなりません。

source: maxLength must be greater than or equal to zero.
ja: maxLengthは、ゼロより大きいか等しくなければなりません。

source: n must be greater than or equal to zero.
ja: nは、ゼロより大きいか等しくなければなりません。

source: nil has a specific meaning in Swift—the absence of a value.
ja: nilはSwiftでは特別な意味を持ちます—値の不在。

source: nil, which gets passed as a null pointer,
ja: nil、それはヌルポインターとして渡されます、

source: position must be a valid index of the collection that is not equal to the endIndex property.
ja: positionはコレクションの有効なインデックスで、endIndexプロパティと等しくないものでなければなりません。

source: position must be a valid index of the dictionary and not equal to endIndex.
ja: positionは、この辞書の有効なインデックスで、endIndexと等しくない必要があります。

source: position must be a valid index of the range, and must not equal the range’s end index.
ja: positionは、この範囲の有効なインデックスでなければなりません、そしてこの範囲の持つ末尾インデックスと等しくてはなりません。

source: range must be finite and non-empty.
ja: rangeは有限でそして空でない必要があります。

source: range must not be empty.
ja: rangeは空であってはいけません。

source: s.joined().map(f) maps eagerly and returns a new array
ja: s.joined().map(f)は先行にマップを行い、新しい配列を返します

source: s.joined() does not create new storage
ja: s.joined()は新しいストレージを作りません

source: s.lazy.joined().map(f) maps lazily and returns a LazyMapSequence
ja: s.lazy.joined().map(f)は遅延にマップして、LazyMapSequenceを返します

source: source must be representable in this type after rounding toward zero.
ja: sourceは、ゼロへの丸め後にこの型において表現可能でなければなりません。

source: source must be representable in this type.
ja: sourceは、この型で表現可能でなければなりません。

source: start must be a valid index of the collection.
ja: startはコレクションのひとつの有効なインデックスでなければなりません。

source: transform accepts an element of this sequence as its parameter and returns a transformed value of the same or of a different type.
ja: transformはこのシーケンスのひとつの要素をそれのパラメータとして受け取り、同じもしくは異なる型の変換された値を返します。

source: transform accepts an element of this sequence as its parameter and returns an AsyncSequence.
ja: transformはこのシーケンスのある要素をそれのパラメータとして受け取り、そしてAsyncSequenceを返します。

source: transform accepts each value of the dictionary as its parameter and returns a transformed value of the same or of a different type.
ja: transformは、辞書の各値をそれのパラメータとして受け取って、同じまたは異なる型の変換した値を返します。

source: transform accepts each value of the dictionary as its parameter and returns an optional transformed value of the same or of a different type.
ja: transformは辞書の各値をそれのパラメータとして受け取ります、そして同じまたは異なる型のあるオプショナルの変換済みの値を返します。

source: true if element is contained in the range; otherwise, false.
ja: elementがこの範囲に含まれるならばtrue；そうでなければ、false。

source: true if i has been offset by exactly distance steps without going beyond limit; otherwise, false.
ja: true、もしiが正確にdistance幅だけlimitを越えていくことなく補われたならば；そうでなければ、falseです。

source: true if lhs is greater than or equal to rhs; otherwise, false.
ja: trueを、lhsがrhsより大きいか等しいならば返します；そうでなければ、false。

source: true if object is known to have a single strong reference; otherwise, false.
ja: objectが強い参照をただ１つだけ持つものと知られているならばtrue；そうでなければ、false。

source: true if other has the same value as this instance; otherwise, false.
ja: otherがこのインスタンスと同じ値を持つならばtrue；そうでなければ、false。

source: true if other is greater than this value; otherwise, false.
ja: true、もしotherがこの値より大きいならば；そうでなければfalse。

source: true if both t0 and t1 are nil or if they represent the same type; otherwise, false.
ja: true、もしt0とt1がnilならば、またはそれらが同じ型を表すならば；そうでなければ、false。

source: true if one, but not both, of t0 and t1 are nil, or if they represent different types; otherwise, false.
ja: true、もしt0とt1の１つが、しかし両方でなくnilならば、またそれらが異なる型を表すならば；そうでなければ、false。

source: true if the element was found in the sequence; otherwise, false.
ja: 要素がシーケンスにおいて見つけられなかったならば、true；そうでなければ、false。

source: true if the initial elements of the sequence are equivalent to the elements of possiblePrefix; otherwise, false.
ja: true、もしシーケンスの冒頭の要素がpossiblePrefixの要素と等しいならば；そうでなければfalse。

source: true if the initial elements of the sequence are the same as the elements of possiblePrefix; otherwise, false.
ja: true、もしシーケンスの冒頭の要素がpossiblePrefixの要素と同じならば；そうでなければfalse。

source: true if the method found the element in the asynchronous sequence; otherwise, false.
ja: true、もしメソッドがその要素をこの非同期シーケンスの中で見つけたならば；そうでなければ、false。

source: true if the sequence contains an element that satisfies predicate; otherwise, false.
ja: このシーケンスがpredicateを満たす要素を含むならばtrue；そうでなければ、false。

source: true if the sequence contains only elements that satisfy predicate; otherwise, false.
ja: true、もしシーケンスがpredicateを満たす要素のみを含むならば；そうでなければ、false。

source: true if the translation detected encoding errors in input; otherwise, false.
ja: 翻訳がinputにおいてエンコーディングエラーを検出したならばtrue；そうでなければfalse。

source: true if this range and other have at least one element in common; otherwise, false.
ja: この範囲とotherが少なくとも１つの共通の要素を持つならば、true；そうでなければ、false。

source: true if this sequence and other contain equivalent items, using areEquivalent as the equivalence test; otherwise, false.
ja: true、このシーケンスとotherがareEquivalentを同等性テストとして使って同じ要素らを含むならば；そうでなければ、false。

source: true if this sequence and other contain the same elements in the same order.
ja: このシーケンスとotherが同じ要素を同じ順序で含んでいるならば、true。

source: true if this sequence precedes other in a dictionary ordering as ordered by areInIncreasingOrder; otherwise, false.
ja: true、もしこのシーケンスがotherに、areInIncreasingOrderによって並べられる通りの字典順序において先行するならば；そうでなければ、false。

source: true if this sequence precedes other in a dictionary ordering; otherwise, false.
ja: このシーケンスがotherに、ある字典順序において先行するならば、true；そうでなければ、false。

source: true if this value is less than other; otherwise, false.
ja: true、もしこの値がotherより少ないならば；そうでなければ、false。

source: true if this value is ordered below or the same as other in a total ordering of the floating-point type; otherwise, false.
ja: true、この値が浮動小数点型の全順序においてotherと同じまたは下に順序付けられるならば；そうでなければ、false。

source: ulpOfOne corresponds to the value represented by the C macros FLT_EPSILON, DBL_EPSILON, etc, and is sometimes called epsilon or machine epsilon.
ja: ulpOfOneは、CマクロFLT_EPSILON、DBL_EPSILON、などによって表される値に対応します、そして時々はイプシロンまたは計算機イプシロンと呼ばれます。

source: value must be representable in this type after rounding toward zero.
ja: valueは、ゼロへの丸め後にこの型において表現可能でなければなりません。

source: withoutActuallyEscaping(_:do:) provides a temporarily escapable copy of predicate that can be used in a call to the lazy view’s filter(_:) method.
ja: withoutActuallyEscaping(_:do:)は、predicateの一時的な脱出可能コピーを提供します、それは遅延ビューのもつfilter(_:)メソッドに対する呼び出しにおいて使用できます。

source: x.isMultiple(of: 0) is true if x is zero and false otherwise.
ja: x.isMultiple(of: 0)はtrueです、もしxがゼロであるならば、そしてそうでなければfalseです。

source: Double is a binary floating-point type that has a radix of 2.
ja: Doubleはバイナリ浮動小数点型で2の基数を持ちます。

source: Equatable is also the base protocol for the Hashable and Comparable protocols, which allow more uses of your custom type, such as constructing sets or sorting the elements of a collection.
ja: Equatableはまた、HashableとComparableプロトコルのための基盤プロトコルです、それらはあなたのあつらえの型のさらなる利用を可能します、例えば集合の組み立てやコレクション要素のソートなど。

source: count must be zero or greater.
ja: countは、ゼロまたはより大きくなければなりません。

source: distance must not be negative unless the collection conforms to the BidirectionalCollection protocol.
ja: distanceは、そのコレクションがBidirectionalCollectionプロトコルに準拠するのでない限り、負であってはなりません。

source: n must not be negative unless the collection conforms to the BidirectionalCollection protocol.
ja: nは、そのコレクションがBidirectionalCollectionプロトコルに準拠するのでない限り、負であってはなりません。

source: radix must be in the range 2...36.
ja: radixは、範囲2...36の中でなければなりません。

source: rhs must not be zero.
ja: rhsは、ゼロではなりません。

source: s must contain exactly one extended grapheme cluster.
ja: sは、厳密に１つの拡張書記素クラスタを含んでいなければなりません。

source: transform can also throw an error, which ends the transformed sequence.
ja: transformはまたエラーをスローできます、それは変換されたシーケンスを終わらせます。

source: type and the type of x must have the same size of memory representation and compatible memory layout.
ja: typeとxの型は、同じ大きさのメモリ表現を持ち、互換メモリレイアウトを持たなければなりません。

source: AnyObject can be used as the concrete type for an instance of any class, class type, or class-only protocol.
ja: AnyObjectは、あらゆるクラス、クラス型、またはクラス専用プロパティのインスタンスに対する具象型として使われることができます。

source: UnsafeContinuation avoids enforcing these invariants at runtime because it aims to be a low-overhead mechanism for interfacing Swift tasks with event loops, delegate methods, callbacks, and other non-async scheduling mechanisms.
ja: UnsafeContinuationは、それら不変式を実行時に遵守させることを避けます、なぜならそれはイベントループを備えるSwiftタスク、委任メソッド、コールバック、そして他の非asyncスケジューリング機構を取り持つことに対して低オーバーヘッド機構であるように努力するからです。

source: element is contained in the range if it is between the two bounds or equal to either bound.
ja: elementは、それが２つの境界の間またはどちらかの境界と等しいならば、その範囲に含まれます。

source: init(stringInterpolation:) should use these properties to initialize the instance.
ja: init(stringInterpolation:)は、それらのプロパティを使ってインスタンスを初期化すべきです。

source: maxSplits must be greater than or equal to zero.
ja: maxSplitsは、ゼロより大きいか等しくなければなりません。

source: numericCast(_:) traps on overflow in -O and -Onone builds.
ja: numericCast(_:)は、-Oおよび-Ononeビルドにおいてオーバーフローでトラップします。

source: n may be positive, negative, or zero.
ja: nは、正、負、またはゼロが許されます。

source: 128.25 is rounded to 128, which is not representable as an Int8 instance, triggering a runtime error.
ja: 128.25は、128へ丸められます、それはInt8インスタンスによって表現可能ではなく、実行時エラーを引き起こします。

source: next() then consumes values from this iterator until it terminates.
ja: next()はそれから、このイテレータから値を消費します、それが終端するまで。

source: BinaryFloatingPoint is implemented in the standard library by Float, Double, and Float80 where available.
ja: BinaryFloatingPointは、標準ライブラリにおいてFloat、Double、そして利用可能なところではFloat80によって実装されます。

source: ExpressibleByNilLiteral conformance for types that use nil for other purposes is discouraged.
ja: nilを他の目的に使う型のためのExpressibleByNilLiteral準拠は、 推奨されません。

source: x.isZero is equivalent to the following comparison: x == 0.0.
ja: x.isZeroは次の比較に相当するものです：x == 0.0。

source: Signed integer types can represent both positive and negative values.
ja: 符号付き整数型は、正および負の値の両方を表すことができます。

source: Unsigned integer types can represent only nonnegative values.
ja: 符号なし整数型は、非負数のみ表すことができます。

source: Required. Default implementation provided.
ja: 必須。 省略時の実装の提供。

source: Required. Default implementations provided.
ja: 必須。 いくつかの省略時の実装の提供。

source: See Also
ja: 参照

source: A 16-bit signed integer value type.
ja: 16ビット符号つき整数値型。

source: A 32-bit floating point type.
ja: 32ビット浮動小数点型。

source: A 32-bit signed integer value type.
ja: 32ビット符号つき整数値型。

source: A 64-bit floating point type.
ja: 64ビット浮動小数点型。

source: A 64-bit signed integer value type.
ja: 64ビット符号付き整数値型。

source: A ClosedRange instance contains both its lower and upper bound.
ja: ClosedRangeインスタンスは、それの下方および上方境界の両方を含みます。

source: A ClosedRange instance contains both its lower bound and its upper bound.
ja: ClosedRangeインスタンスは、それの下側の境界とそれの上側の境界の両方を含みます。

source: A Collection that provides its own implementation of this method must also guarantee that an equivalent buffer of its SubSequence can be generated by advancing the pointer by the distance to the slice’s startIndex.
ja: このメソッドのそれ独自の実装を提供するCollectionはまた、それのSubSequenceの同等のバッファが、スライスのもつstartIndexへの隔たりだけポインタを前進することによって生成されることを保証しなければなりません。

source: A Range to convert to a ClosedRange instance.
ja: あるRange、ClosedRangeインスタンスへと変換することになります。

source: A ReversedCollection instance wraps an underlying collection and provides access to its elements in reverse order.
ja: ReversedCollectionインスタンスは、基礎をなすコレクションをラップして、それの要素へのアクセスを逆順で提供します。

source: A binade is a set of binary floating-point values that all have the same sign and exponent.
ja: binadeは、バイナリ浮動小数点値の一揃いです、それは全てが同じ符号と指数を持ちます。

source: A continuation is an opaque representation of program state.
ja: ある継続は、プログラム状態の不透明表現です。

source: A decimal value contains the significand, a sequence of decimal digits that may include a decimal point.
ja: 10進の値は仮数、小数点を含んでも良い一連の10進の桁を含みます。

source: A hexadecimal value contains the significand, either 0X or 0x, followed by a sequence of hexadecimal digits.
ja: 16進数値は、仮数、0Xまたは0xのどちらかに続く16進の桁を含みます。

source: A normal value is a finite number that uses the full precision available to values of a type.
ja: ノーマル値は、有限数で、ある型の値に利用可能な完全な精度を使います。

source: A subnormal value is a nonzero number that has a lesser magnitude than the smallest normal number.
ja: サブノーマル値は、非ゼロ数で、最も小さいノーマル数よりも少ない規模を持つものです。

source: A Boolean value converts to an MLDataValue.ValueType.int.
ja: ブール値は、MLDataValue.ValueType.intに変わります。

source: A Boolean value indicating whether the collection is empty.
ja: コレクションが空かどうかを指し示すブール値。

source: A Boolean value indicating whether the instance is NaN (“not a number”).
ja: このインスタンスがNaN（非数）であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the instance is a signaling NaN.
ja: このインスタンスがsignaling NaNであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the instance is equal to zero.
ja: このインスタンスがゼロと等しいかどうかを指し示すブール値。

source: A Boolean value indicating whether the instance is infinite.
ja: このインスタンスが無限大であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the instance is subnormal.
ja: このインスタンスがサブノーマルであるかどうかを指し示すブール値。

source: A Boolean value indicating whether the instance’s representation is in its canonical form.
ja: このインスタンスの表現がそれの正準形式であるかどうかを指し示すブール値。

source: A Boolean value indicating whether the range contains no elements.
ja: 範囲が何の要素も含まないかどうかを指し示すブール値を返します。

source: A Boolean value indicating whether this character changes under any form of case conversion.
ja: この文字がケース変換の何らかの形式の下で変化するかどうかを指し示すブール値。
